<a href="https://colab.research.google.com/github/erena29/Data-Analysis-SQL/blob/main/Property%20Management/Property_Data.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Property Management Data Analysis**

## Data Import and Database Setup

In [1]:
import pandas as pd
import sqlite3

In [2]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [4]:
exp = pd.read_csv('/content/drive/MyDrive/Dataset/Property_management/Expense.csv')
prop = pd.read_csv('/content/drive/MyDrive/Dataset/Property_management/Property.csv')
sales = pd.read_csv('/content/drive/MyDrive/Dataset/Property_management/Sales.csv')

In [6]:
# Load the SQL extension
%load_ext sql

# Create a SQLite database
%sql sqlite://

In [7]:
%sql drop table if exists exp, prop, sales;

# Persist the DataFrames as tables in SQLi
%sql --persist exp
%sql --persist prop
%sql --persist sales

 * sqlite://
(sqlite3.OperationalError) near ",": syntax error
[SQL: drop table if exists exp, prop, sales;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)
 * sqlite://
 * sqlite://
 * sqlite://

'Persisted sales'

## Sample Data

In [22]:
%%sql
SELECT * FROM sales LIMIT 5;

 * sqlite://
Done.

[(0, 1, 1, '2023-07-14', 'Broker', 131, 'Paid'),
 (1, 2, 3, '2024-04-28', 'Direct', 198, 'Paid'),
 (2, 3, 4, '2022-01-05', 'Online', 123, 'Pending'),
 (3, 4, 5, '2022-02-04', 'Online', 198, 'Paid'),
 (4, 5, 6, '2022-06-17', 'Online', 198, 'Pending')]

In [23]:
%%sql
SELECT * FROM prop LIMIT 5;

 * sqlite://
Done.

[(0, 10, 'Mexico', 'Townhouse', 1, 3, 1200, 200000, '03-01-2022', 'Sold'),
 (1, 128, 'Italy', 'Townhouse', 4, 1, 1800, 200000, '03-02-2022', 'Sold'),
 (2, 129, 'France', 'Condo', 3, 2, 2500, 800000, '04-02-2022', 'Sold'),
 (3, 185, 'Brazil', 'Apartment', 2, 2, 1000, 1000000, '08-02-2022', 'Sold'),
 (4, 3, 'Germany', 'Townhouse', 2, 4, 750, 700000, '10-02-2022', 'Sold')]

In [24]:
%%sql
SELECT * FROM exp LIMIT 5;

 * sqlite://
Done.

[(0, 1, 1, 'Maintenance', 100000, '2023-01-28'),
 (1, 2, 3, 'Maintenance', 300000, '2023-01-20'),
 (2, 3, 4, 'Maintenance', 250000, '2023-11-01'),
 (3, 4, 5, 'Renovation', 50000, '2023-09-10'),
 (4, 5, 6, 'Maintenance', 250000, '2023-05-25')]

## SQL Analysis

In [25]:
%%sql
SELECT
  strftime('%Y', s.SaleDate) AS Year,
  SUM(p.Price) AS Total_Revenue,
  SUM(e.Amount) AS Total_Expense,
  SUM(p.Price) - SUM(e.Amount) AS Total_Income,
  COUNT(CASE WHEN p.Status = 'Sold' THEN 1 END) AS Properties_Sold
FROM sales AS s
LEFT JOIN prop AS p ON s.PropertyID_Sale = p.PropertyID
LEFT JOIN exp AS e ON s.PropertyID_Sale = e.PropertyID_Expense
GROUP BY Year
ORDER BY Year;

 * sqlite://
Done.

[('2022', 29900000, 10350000, 19550000, 56),
 ('2023', 40800000, 10550000, 30250000, 60),
 ('2024', 25500000, 8700000, 16800000, 44)]

In [21]:
%%sql
SELECT
  strftime('%Y',SaleDate) AS Year,
  COUNT(SaleID)
FROM sales
GROUP BY Year
ORDER BY Year;

 * sqlite://
Done.

[('2022', 56), ('2023', 60), ('2024', 44)]